# add() - ამატებს ერთ ელემენტს set-ში
# remove() - შლის ელემენტს set-იდან, მაგრამ თუ ელემენტი არ არსებობს გამოიტანს error-ს
# discard() - შლის ელემენტს set-იდან, მაგრამ თუ ელემენტი არ არსებობს error-ს არ გამოიტანს
# clear() - შლის set-ის ყველა ელემენტს და ტოვებს ცარიელს
# pop() - შლის შემთხვევით ელემენტს set-იდან და აბრუნებს მას
# update() - ამატებს სხვა set-ის ან სიის ელემენტებს
# union() - აერთიანებს ორ set-ს
# intersection() - გამოაქვს ელემენტები, რომლებიც ორივე set-შია
# difference() - გამოაქვს ელემენტები, რომლებიც მხოლოდ პირველ set-შია
# symmetric_difference() - გამოაქვს ელემენტები, რომლებიც მხოლოდ ერთ-ერთ set-შია